Revit 2026 API

# View3DOrientTo Method

---

Reorients the view to align with the forward direction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void OrientTo(
	XYZ forwardDirection
)
```
```vb
Public Sub OrientTo (
	forwardDirection As XYZ
)
```
```cpp
public:
void OrientTo(
	XYZ^ forwardDirection
)
```
```fsharp
member OrientTo :
        forwardDirection : XYZ -> unit
```

#### Parameters

forwardDirection XYZ
     The forward direction.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | forwardDirection has zero length. |
| InvalidOperationException | View is locked and cannot be reoriented. |

This method adjusts the ViewOrientation to align with the input forward direction. The eye position will be automatically determined based on the shape of the viewing area and size of the model. The UpDirection will be aligned with the project Z axis.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace